# 5. Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

print('\nВведите координаты точки А:')
x1 = int(input('координата x = '))
y1 = int(input('координата y = '))

print('\nВведите координаты точки Б:')
x2 = int(input('координата x = '))
y2 = int(input('координата y = '))

distance = round(((x1-x2)**2+(y1-y2)**2)**0.5, 2)
print(f'\nA ({x1},{y1}); B ({x2},{y2}) -> {distance}')